; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v1 ?v3)
             (pred_5 ?v5 ?v7)
             (pred_7 ?v1 ?v7)
             (pred_8 ?v12 ?v1 )
	     (pred_11 ?v1)
             (pred_12 ?v11)
             (pred_1 ?v5)
             (pred_10 ?v7)
             (pred_4 ?v1)
             (pred_2 ?v5)
             (pred_6 ?v1)
             (pred_3 ))



(:action op_3
:parameters (?v6 ?v10 ?v8 ?v13)
:precondition (and (pred_12 ?v6) (pred_12 ?v10) (pred_1 ?v8) (pred_10 ?v13)
          (pred_9 ?v6 ?v10) (pred_5 ?v8 ?v13)
                   (pred_7 ?v10 ?v13) (pred_11 ?v6) 
                   (pred_4 ?v10) (pred_2 ?v8))
:effect (and  (pred_6 ?v10) (not (pred_4 ?v10))))


(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_12 ?v6) (pred_12 ?v4)
               (pred_11 ?v6) (pred_9 ?v6 ?v4) (pred_6 ?v4))
:effect (and (pred_11 ?v4) (not (pred_11 ?v6))))

(:action op_1
:parameters (?v6 ?v8)
:precondition (and (pred_12 ?v6) (pred_1 ?v8) 
                  (pred_11 ?v6) (pred_8 ?v8 ?v6) (pred_3 ))
:effect (and (pred_2 ?v8)
   (not (pred_8 ?v8 ?v6)) (not (pred_3 ))))


(:action op_2
:parameters (?v6 ?v2 ?v9)
:precondition (and (pred_12 ?v6) (pred_1 ?v2) (pred_1 ?v9)
                  (pred_11 ?v6) (pred_2 ?v9) (pred_8 ?v2 ?v6))
:effect (and (pred_2 ?v2) (pred_8 ?v9 ?v6)
        (not (pred_2 ?v9)) (not (pred_8 ?v2 ?v6))))

(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_12 ?v6) (pred_1 ?v8) 
                  (pred_11 ?v6) (pred_2 ?v8))
:effect (and (pred_3 ) (pred_8 ?v8 ?v6) (not (pred_2 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_22 obj_16 obj_08 obj_29 obj_27 obj_26 obj_09 obj_18 obj_02 obj_12 obj_24 obj_05 obj_04 obj_25 obj_14 obj_28 obj_19 obj_30 obj_23 obj_06 obj_21 obj_31 obj_11 obj_32 obj_01
    obj_03 obj_07 obj_10
    obj_15 obj_13 obj_20 obj_17
    )

    (:init
       (pred_3)

       (pred_12 obj_22)
       (pred_12 obj_16)
       (pred_12 obj_08)
       (pred_12 obj_29)
       (pred_12 obj_27)
       (pred_12 obj_26)
       (pred_12 obj_09)
       (pred_12 obj_18)
       (pred_12 obj_02)
       (pred_12 obj_12)
       (pred_12 obj_24)
       (pred_12 obj_05)
       (pred_12 obj_04)
       (pred_12 obj_25)
       (pred_12 obj_14)
       (pred_12 obj_28)
       (pred_12 obj_19)
       (pred_12 obj_30)
       (pred_12 obj_23)
       (pred_12 obj_06)
       (pred_12 obj_21)
       (pred_12 obj_31)
       (pred_12 obj_11)
       (pred_12 obj_32)
       (pred_12 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_1 obj_20)
       (pred_1 obj_17)

       (pred_9 obj_22 obj_26)
       (pred_9 obj_22 obj_16)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_16 obj_08)
       (pred_9 obj_16 obj_22)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_08 obj_29)
       (pred_9 obj_08 obj_16)
       (pred_9 obj_29 obj_02)
       (pred_9 obj_29 obj_27)
       (pred_9 obj_29 obj_08)
       (pred_9 obj_27 obj_12)
       (pred_9 obj_27 obj_29)
       (pred_9 obj_26 obj_24)
       (pred_9 obj_26 obj_09)
       (pred_9 obj_26 obj_22)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_26)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_02 obj_25)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_02 obj_29)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_12 obj_27)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_24 obj_28)
       (pred_9 obj_24 obj_05)
       (pred_9 obj_24 obj_26)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_05 obj_24)
       (pred_9 obj_04 obj_30)
       (pred_9 obj_04 obj_25)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_25 obj_23)
       (pred_9 obj_25 obj_14)
       (pred_9 obj_25 obj_02)
       (pred_9 obj_25 obj_04)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_14 obj_25)
       (pred_9 obj_28 obj_21)
       (pred_9 obj_28 obj_19)
       (pred_9 obj_28 obj_24)
       (pred_9 obj_19 obj_31)
       (pred_9 obj_19 obj_30)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_28)
       (pred_9 obj_30 obj_11)
       (pred_9 obj_30 obj_23)
       (pred_9 obj_30 obj_04)
       (pred_9 obj_30 obj_19)
       (pred_9 obj_23 obj_32)
       (pred_9 obj_23 obj_06)
       (pred_9 obj_23 obj_25)
       (pred_9 obj_23 obj_30)
       (pred_9 obj_06 obj_01)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_23)
       (pred_9 obj_21 obj_31)
       (pred_9 obj_21 obj_28)
       (pred_9 obj_31 obj_11)
       (pred_9 obj_31 obj_19)
       (pred_9 obj_31 obj_21)
       (pred_9 obj_11 obj_32)
       (pred_9 obj_11 obj_30)
       (pred_9 obj_11 obj_31)
       (pred_9 obj_32 obj_01)
       (pred_9 obj_32 obj_23)
       (pred_9 obj_32 obj_11)
       (pred_9 obj_01 obj_06)
       (pred_9 obj_01 obj_32)
       (pred_4 obj_11)
       (pred_4 obj_21)
       (pred_4 obj_31)
       (pred_4 obj_16)
       (pred_7  obj_11 obj_03)
       (pred_7  obj_21 obj_07)
       (pred_7  obj_31 obj_10)
       (pred_7  obj_16 obj_10)
       (pred_6 obj_22)
       (pred_6 obj_08)
       (pred_6 obj_29)
       (pred_6 obj_27)
       (pred_6 obj_26)
       (pred_6 obj_09)
       (pred_6 obj_18)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_24)
       (pred_6 obj_05)
       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_14)
       (pred_6 obj_28)
       (pred_6 obj_19)
       (pred_6 obj_30)
       (pred_6 obj_23)
       (pred_6 obj_06)
       (pred_6 obj_32)
       (pred_6 obj_01)

       (pred_5  obj_15 obj_03)
       (pred_5  obj_13 obj_07)
       (pred_5  obj_20 obj_10)
       (pred_5  obj_17 obj_10)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_20 obj_25)
       (pred_8 obj_17 obj_08)
       (pred_11 obj_06)
    )

    (:goal (and
       (pred_8 obj_20 obj_14)
       (pred_8 obj_17 obj_23)
    ))
(:constraints
  (always (not (pred_11 obj_02)))
)
)

; plan
1. (op_4 obj_06 obj_23)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_23)
   goals met: 0 of 2
2. (op_4 obj_23 obj_25)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_25)
   goals met: 0 of 2
3. (op_4 obj_25 obj_04)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_04)
   goals met: 0 of 2
4. (op_4 obj_04 obj_18)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_18)
   goals met: 0 of 2
5. (op_4 obj_18 obj_08)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_08)
   goals met: 0 of 2
6. (op_1 obj_08 obj_17)
   deleted: (pred_8 obj_17 obj_08) (pred_3)
   added: (pred_2 obj_17)
   goals met: 0 of 2
7. (op_4 obj_08 obj_29)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_29)
   goals met: 0 of 2
8. (op_4 obj_29 obj_27)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_27)
   goals met: 0 of 2
9. (op_4 obj_27 obj_12)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_12)
   goals met: 0 of 2
10. (op_4 obj_12 obj_14)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_14)
   goals met: 0 of 2
11. (op_4 obj_14 obj_25)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_25)
   goals met: 0 of 2
12. (op_4 obj_25 obj_23)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_23)
   goals met: 0 of 2
13. (op_5 obj_23 obj_17)
   deleted: (pred_2 obj_17)
   added: (pred_3) (pred_8 obj_17 obj_23)
   goals met: 1 of 2
14. (op_4 obj_23 obj_25)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_25)
   goals met: 1 of 2
15. (op_1 obj_25 obj_20)
   deleted: (pred_8 obj_20 obj_25) (pred_3)
   added: (pred_2 obj_20)
   goals met: 1 of 2
16. (op_4 obj_25 obj_14)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_14)
   goals met: 1 of 2
17. (op_5 obj_14 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_3) (pred_8 obj_20 obj_14)
   goals met: 2 of 2
